dragon-dreamer/mcutl/tests/stm32f1_adc_tests.cpp
#define STM32F103xG
#define STM32F1

#include <stdint.h>
#include <type_traits>

#include "mcutl/adc/adc.h"
#include "mcutl/clock/clock.h"
#include "mcutl/dma/dma.h"
#include "mcutl/gpio/gpio.h"
#include "mcutl/interrupt/interrupt.h"
#include "mcutl/periph/periph.h"
#include "mcutl/systick/systick.h"
#include "mcutl/tests/mcu.h"
#include "mcutl/utils/type_helpers.h"

#include "gtest/gtest.h"
#include "gmock/gmock.h"

#include "stm32f1_dma_test_fixture.h"
#include "stm32f1_exti_interrupt_test_fixture.h"

class adc_strict_test_fixture_base
	: public dma_strict_test_fixture
	, public exti_interrupt_test_fixture
{
public:
	template<typename Adc, uint8_t... Channels, typename... Gpios>
	void test_gpio_mapping(mcutl::types::list<Gpios...>)
	{
		(... , test_single_gpio_mapping<Adc, Channels, Gpios>());
	}
	
private:
	template<typename Adc, uint8_t Channel, typename Gpio>
	void test_single_gpio_mapping()
	{
		EXPECT_TRUE((std::is_same_v<mcutl::adc::map_adc_channel_to_gpio<Adc, mcutl::adc::channel<Channel>>,
			Gpio>));
		EXPECT_TRUE((std::is_same_v<mcutl::adc::map_gpio_to_adc_channel<Adc, Gpio>,
			mcutl::adc::channel<Channel>>));
	}
};

template<typename Adc>
class adc_strict_test_fixture : public adc_strict_test_fixture_base
{
public:
	using adc = Adc;
	
	auto get_adc() noexcept
	{
		if constexpr (std::is_same_v<Adc, mcutl::adc::adc1>)
			return ADC1;
		else if constexpr (std::is_same_v<Adc, mcutl::adc::adc2>)
			return ADC2;
		else
			return ADC3;
	}
	
	void expect_wait_calibration_winished()
	{
		EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)))
			.Times(2)
			.WillOnce(::testing::DoDefault())
			.WillRepeatedly([] (auto) { return 0u; });
	}
	
	void expect_enable_peripheral()
	{
		EXPECT_CALL(this->memory(), read(this->addr(&RCC->APB2ENR)));
		EXPECT_CALL(this->memory(), write(this->addr(&RCC->APB2ENR),
			this->get_adc_periph_bit()));
		EXPECT_CALL(this->memory(), read(this->addr(&RCC->APB2ENR)));
	}
	
	static uint32_t get_adc_periph_bit() noexcept
	{
		if constexpr (std::is_same_v<adc, mcutl::adc::adc1>)
			return RCC_APB2ENR_ADC1EN;
		else if constexpr (std::is_same_v<adc, mcutl::adc::adc2>)
			return RCC_APB2ENR_ADC2EN;
		else
			return RCC_APB2ENR_ADC3EN;
	}
	
	static uint32_t get_dma_channel() noexcept
	{
		static_assert(!std::is_same_v<adc, mcutl::adc::adc2>);
		return std::is_same_v<adc, mcutl::adc::adc1>
			? DMA1_Channel1_BASE : DMA2_Channel5_BASE;
	}
	
	void setup_systick()
	{
		this->memory().allow_reads(this->addr(&SysTick->LOAD));
		this->memory().allow_reads(this->addr(&SysTick->VAL));
		this->memory().set(this->addr(&SysTick->LOAD), 10u);
	}
	
	void expect_wait_init()
	{
		EXPECT_CALL(this->memory(), read(this->addr(&SysTick->CTRL)))
			.Times(10)
			.WillRepeatedly([] (auto) {
				return SysTick_CTRL_COUNTFLAG_Msk;
			});
	}
};

TEST_F(adc_strict_test_fixture_base, TraitsTest)
{
	EXPECT_TRUE(mcutl::adc::supports_calibration<mcutl::adc::adc1>);
	EXPECT_TRUE(mcutl::adc::supports_calibration<mcutl::adc::adc2>);
	EXPECT_TRUE(mcutl::adc::supports_calibration<mcutl::adc::adc3>);
	EXPECT_TRUE(mcutl::adc::supports_input_impedance_option<mcutl::adc::adc1>);
	EXPECT_TRUE(mcutl::adc::supports_input_impedance_option<mcutl::adc::adc2>);
	EXPECT_TRUE(mcutl::adc::supports_input_impedance_option<mcutl::adc::adc3>);
	EXPECT_TRUE(mcutl::adc::supports_atomic_clear_pending_flags<mcutl::adc::adc1>);
	EXPECT_TRUE(mcutl::adc::supports_atomic_clear_pending_flags<mcutl::adc::adc2>);
	EXPECT_TRUE(mcutl::adc::supports_atomic_clear_pending_flags<mcutl::adc::adc3>);
	
	EXPECT_TRUE((std::is_same_v<mcutl::adc::peripheral_type<mcutl::adc::adc1>, mcutl::periph::adc1>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::peripheral_type<mcutl::adc::adc2>, mcutl::periph::adc2>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::peripheral_type<mcutl::adc::adc3>, mcutl::periph::adc3>));
	
	EXPECT_TRUE((std::is_same_v<mcutl::adc::interrupt_type<mcutl::adc::adc1,
		mcutl::adc::init::interrupt::conversion_complete>, mcutl::interrupt::type::adc1_2>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::interrupt_type<mcutl::adc::adc2,
		mcutl::adc::init::interrupt::conversion_complete>, mcutl::interrupt::type::adc1_2>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::interrupt_type<mcutl::adc::adc3,
		mcutl::adc::init::interrupt::conversion_complete>, mcutl::interrupt::type::adc3>));
	
	EXPECT_TRUE((std::is_same_v<mcutl::adc::conversion_result_type<mcutl::adc::adc1>, uint16_t>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::conversion_result_type<mcutl::adc::adc2>, uint16_t>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::conversion_result_type<mcutl::adc::adc3>, uint16_t>));
	
	EXPECT_EQ(mcutl::adc::resolution_bits<mcutl::adc::adc1>, 12);
	EXPECT_EQ(mcutl::adc::resolution_bits<mcutl::adc::adc2>, 12);
	EXPECT_EQ(mcutl::adc::resolution_bits<mcutl::adc::adc3>, 12);
	
	EXPECT_EQ(mcutl::adc::max_result_value<mcutl::adc::adc1>, 0xfffu);
	EXPECT_EQ(mcutl::adc::max_result_value<mcutl::adc::adc2>, 0xfffu);
	EXPECT_EQ(mcutl::adc::max_result_value<mcutl::adc::adc3>, 0xfffu);
	
	EXPECT_TRUE((std::is_same_v<mcutl::adc::gpio_config, mcutl::gpio::in::analog>));
}

TEST_F(adc_strict_test_fixture_base, MappingsTest)
{
	test_gpio_mapping<mcutl::adc::adc1,
		10, 11, 12, 13, 0, 1, 2, 3, 4, 5, 6, 7, 14, 15, 8, 9>
	(mcutl::types::list<
		mcutl::gpio::gpioc<0>,
		mcutl::gpio::gpioc<1>,
		mcutl::gpio::gpioc<2>,
		mcutl::gpio::gpioc<3>,
		mcutl::gpio::gpioa<0>,
		mcutl::gpio::gpioa<1>,
		mcutl::gpio::gpioa<2>,
		mcutl::gpio::gpioa<3>,
		mcutl::gpio::gpioa<4>,
		mcutl::gpio::gpioa<5>,
		mcutl::gpio::gpioa<6>,
		mcutl::gpio::gpioa<7>,
		mcutl::gpio::gpioc<4>,
		mcutl::gpio::gpioc<5>,
		mcutl::gpio::gpiob<0>,
		mcutl::gpio::gpiob<1>
	>{});
	
	test_gpio_mapping<mcutl::adc::adc2,
		10, 11, 12, 13, 0, 1, 2, 3, 4, 5, 6, 7, 14, 15, 8, 9>
	(mcutl::types::list<
		mcutl::gpio::gpioc<0>,
		mcutl::gpio::gpioc<1>,
		mcutl::gpio::gpioc<2>,
		mcutl::gpio::gpioc<3>,
		mcutl::gpio::gpioa<0>,
		mcutl::gpio::gpioa<1>,
		mcutl::gpio::gpioa<2>,
		mcutl::gpio::gpioa<3>,
		mcutl::gpio::gpioa<4>,
		mcutl::gpio::gpioa<5>,
		mcutl::gpio::gpioa<6>,
		mcutl::gpio::gpioa<7>,
		mcutl::gpio::gpioc<4>,
		mcutl::gpio::gpioc<5>,
		mcutl::gpio::gpiob<0>,
		mcutl::gpio::gpiob<1>
	>{});
	
