dragon-dreamer/mcutl/tests/stm32f1_adc_tests.cpp
	test_gpio_mapping<mcutl::adc::adc3,
		4, 5, 6, 7, 8, 10, 11, 12, 13, 0, 1, 2, 3>
	(mcutl::types::list<
		mcutl::gpio::gpiof<6>,
		mcutl::gpio::gpiof<7>,
		mcutl::gpio::gpiof<8>,
		mcutl::gpio::gpiof<9>,
		mcutl::gpio::gpiof<10>,
		mcutl::gpio::gpioc<0>,
		mcutl::gpio::gpioc<1>,
		mcutl::gpio::gpioc<2>,
		mcutl::gpio::gpioc<3>,
		mcutl::gpio::gpioa<0>,
		mcutl::gpio::gpioa<1>,
		mcutl::gpio::gpioa<2>,
		mcutl::gpio::gpioa<3>
	>{});
}

using simple_clock_config = mcutl::clock::config<
	mcutl::clock::internal_high_speed_crystal,
	mcutl::clock::adc<mcutl::clock::required_frequency<14'000'000>>>;

TEST_F(adc_strict_test_fixture_base, TimesTest)
{
	EXPECT_TRUE((std::is_same_v<mcutl::adc::initialization_time<mcutl::adc::adc1, simple_clock_config>,
		mcutl::types::microseconds<1>>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::initialization_time<mcutl::adc::adc2, simple_clock_config>,
		mcutl::types::microseconds<1>>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::initialization_time<mcutl::adc::adc3, simple_clock_config>,
		mcutl::types::microseconds<1>>));
	
	EXPECT_TRUE((std::is_same_v<mcutl::adc::calibration_time<mcutl::adc::adc1, simple_clock_config>,
		mcutl::types::microseconds<6>>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::calibration_time<mcutl::adc::adc2, simple_clock_config>,
		mcutl::types::microseconds<6>>));
	EXPECT_TRUE((std::is_same_v<mcutl::adc::calibration_time<mcutl::adc::adc3, simple_clock_config>,
		mcutl::types::microseconds<6>>));
}

using adc_list = ::testing::Types<mcutl::adc::adc1, mcutl::adc::adc2, mcutl::adc::adc3>;

template<typename Adc> using adc_list_test_fixture = adc_strict_test_fixture<Adc>;
TYPED_TEST_SUITE(adc_list_test_fixture, adc_list);

TYPED_TEST(adc_list_test_fixture, PendingFlagsTest)
{
	using adc = typename TestFixture::adc;
	EXPECT_EQ((mcutl::adc::pending_flags_v<adc,
		mcutl::adc::init::interrupt::conversion_complete>), ADC_SR_EOS);
	EXPECT_EQ(mcutl::adc::pending_flags_v<adc>, 0u);
}

TYPED_TEST(adc_list_test_fixture, GetPendingFlagsTest)
{
	using adc = typename TestFixture::adc;
	this->memory().allow_reads(this->addr(&this->get_adc()->SR));
	
	EXPECT_EQ((mcutl::adc::get_pending_flags<adc,
		mcutl::adc::init::interrupt::conversion_complete>()), 0u);
	EXPECT_EQ((mcutl::adc::get_pending_flags<adc>()), 0u);
	
	this->memory().set(this->addr(&this->get_adc()->SR), ADC_SR_EOS);
	
	EXPECT_EQ((mcutl::adc::get_pending_flags<adc,
		mcutl::adc::init::interrupt::conversion_complete>()), ADC_SR_EOS);
	EXPECT_EQ((mcutl::adc::get_pending_flags<adc>()), 0u);
}

TYPED_TEST(adc_list_test_fixture, ClearPendingFlagsTest)
{
	static constexpr uint32_t initial_sr = 0xffffffffu;
	
	using adc = typename TestFixture::adc;
	this->memory().set(this->addr(&this->get_adc()->SR), initial_sr);
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SR),
		initial_sr & ~ADC_SR_EOS));
	
	mcutl::adc::clear_pending_flags<adc,
		mcutl::adc::init::interrupt::conversion_complete>();
	
	this->memory().set(this->addr(&this->get_adc()->SR), initial_sr);
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SR),
		initial_sr & ~ADC_SR_EOS));
	
	mcutl::adc::clear_pending_flags_atomic<adc,
		mcutl::adc::init::interrupt::conversion_complete>();
}

TYPED_TEST(adc_list_test_fixture, CalibrationFinishedTest)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	
	EXPECT_TRUE(mcutl::adc::is_calibration_finished<adc>());
	
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_CAL);
	
	EXPECT_FALSE(mcutl::adc::is_calibration_finished<adc>());
}

TYPED_TEST(adc_list_test_fixture, CalibrationAlreadyInProgressTest)
{
	using adc = typename TestFixture::adc;
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_CAL);
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	mcutl::adc::calibrate<adc>();
}

TYPED_TEST(adc_list_test_fixture, CalibrationAlreadyInProgressWaitTest)
{
	using adc = typename TestFixture::adc;
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_CAL);
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	this->expect_wait_calibration_winished();
	
	mcutl::adc::calibrate<adc, mcutl::adc::cal::wait_finished<72'000'000, simple_clock_config>>();
}

TYPED_TEST(adc_list_test_fixture, CalibrationTest)
{
	using adc = typename TestFixture::adc;
	constexpr uint32_t initial_cr2 = 0xffffffffu & ~ADC_CR2_CAL;
	
	this->memory().set(this->addr(&this->get_adc()->CR2), initial_cr2);
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		initial_cr2 | ADC_CR2_CAL));
	
	mcutl::adc::calibrate<adc>();
}

TYPED_TEST(adc_list_test_fixture, CalibrationWaitTest)
{
	using adc = typename TestFixture::adc;
	constexpr uint32_t initial_cr2 = 0xffffffffu & ~ADC_CR2_CAL;
	
	this->memory().set(this->addr(&this->get_adc()->CR2), initial_cr2);
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		initial_cr2 | ADC_CR2_CAL));
	this->expect_wait_calibration_winished();
	
	mcutl::adc::calibrate<adc, mcutl::adc::cal::wait_finished<72'000'000, simple_clock_config>>();
}

TYPED_TEST(adc_list_test_fixture, SingleConversionTest)
{
	using adc = typename TestFixture::adc;
	
	constexpr uint32_t initial_cr2 = 0xffffffffu & ~ADC_CR2_ADON;
	this->memory().set(this->addr(&this->get_adc()->CR2), initial_cr2);
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	
	auto conv = mcutl::adc::prepare_conversion<adc, mcutl::adc::channel<3>>();
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		initial_cr2 | ADC_CR2_ADON));
	conv.start();
	
	this->memory().allow_reads(this->addr(&this->get_adc()->DR));
	this->memory().set(this->addr(&this->get_adc()->DR), 12345u);
	EXPECT_EQ(conv.get_conversion_result(), 12345u);
	
	this->memory().allow_reads(this->addr(&this->get_adc()->SR));
	EXPECT_FALSE(conv.is_finished());
	this->memory().set(this->addr(&this->get_adc()->SR), ADC_SR_EOS);
	EXPECT_TRUE(conv.is_finished());
}

