dragon-dreamer/mcutl/tests/stm32f1_adc_tests.cpp
TYPED_TEST(adc_list_test_fixture, ScanConversionTest)
{
	using adc = typename TestFixture::adc;
	constexpr uint32_t initial_cr2 = 0xffffffffu & ~ADC_CR2_ADON;
	this->memory().set(this->addr(&this->get_adc()->CR2), initial_cr2);
	
	if constexpr (!std::is_same_v<adc, mcutl::adc::adc2>)
	{
		static constexpr uint32_t channel_count = 3;
		auto conv = mcutl::adc::prepare_conversion<adc, mcutl::adc::conv::scan_channels<
			mcutl::adc::dma_channel_config<mcutl::adc::dma_channel<adc>>,
			mcutl::adc::channel<1>,
			mcutl::adc::channel<4>,
			mcutl::adc::channel<7>>
		>();
		
		{
			::testing::Sequence s1, s2, s3;
			
			this->expect_start_transfer(this->get_dma_channel(), 0,
				&(this->get_adc()->DR),
				this->to_address, channel_count,
				s1, s2, s3);
			
			EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)))
				.InSequence(s1, s2, s3);
			EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
				initial_cr2 | ADC_CR2_ADON))
				.InSequence(s1, s2, s3);
			
			conv.start(static_cast<uint16_t*>(this->to_address));
		}
		
		this->memory().allow_reads(this->addr(&this->get_adc()->SR));
		EXPECT_FALSE(conv.is_finished());
		this->memory().set(this->addr(&this->get_adc()->SR), ADC_SR_EOS);
		EXPECT_TRUE(conv.is_finished());
	}
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest1)
{
	using adc = typename TestFixture::adc;
	
	::testing::InSequence s;
	this->expect_enable_peripheral();
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1),
		(1u << ADC_SQR1_L_Pos)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3),
		5u));
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1),
		ADC_CR1_EOSIE));
	
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		ADC_CR2_ADON | ADC_CR2_ALIGN));
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::enable_peripheral<true>,
		mcutl::adc::channel<5>,
		mcutl::adc::init::enable<true>,
		mcutl::adc::init::data_alignment::left,
		mcutl::adc::init::interrupt::conversion_complete,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest2)
{
	using adc = typename TestFixture::adc;
	
	this->memory().set(this->addr(&RCC->APB2ENR), this->get_adc_periph_bit());
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), read(this->addr(&RCC->APB2ENR)));
	EXPECT_CALL(this->memory(), write(this->addr(&RCC->APB2ENR), 0u));
	EXPECT_CALL(this->memory(), read(this->addr(&RCC->APB2ENR)));
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::enable_peripheral<false>,
		mcutl::adc::init::enable<false>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest3)
{
	using adc = typename TestFixture::adc;
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR2),
		0b011u << ADC_SMPR2_SMP7_Pos));
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::input_impedance<mcutl::adc::channel<7>, 25'000, simple_clock_config>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest4)
{
	using adc = typename TestFixture::adc;
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR1),
		0b101u << ADC_SMPR1_SMP10_Pos));
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::sample_time<mcutl::adc::channel<10>,
			mcutl::adc::init::sample_time_cycles::cycles_55_5>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest5)
{
	using adc = typename TestFixture::adc;
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::wait_finished<72'000'000, simple_clock_config>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest6)
{
	using adc = typename TestFixture::adc;
	
	if constexpr (!std::is_same_v<adc, mcutl::adc::adc2>)
	{
		using dma_config = mcutl::adc::dma_channel_config<mcutl::adc::dma_channel<adc>>;
		
		::testing::InSequence s;
		
		this->expect_configure(this->get_dma_channel(),
			DMA_CCR_MINC | DMA_CCR_PSIZE_1 | DMA_CCR_MSIZE_0,
			0, mcutl::interrupt::default_priority, 0,
			0x12345678u & ~DMA_CCR_EN);
		
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1),
			0u << ADC_SQR1_SQ13_Pos
			| 12u << ADC_SQR1_SQ14_Pos
			| 14u << ADC_SQR1_L_Pos));
	
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR2),
			6u << ADC_SQR2_SQ7_Pos
			| 11u << ADC_SQR2_SQ8_Pos
			| 8u << ADC_SQR2_SQ9_Pos
			| 2u << ADC_SQR2_SQ10_Pos
			| 1u << ADC_SQR2_SQ11_Pos
			| 9u << ADC_SQR2_SQ12_Pos));
	
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3),
			1u << ADC_SQR3_SQ1_Pos
			| 0u << ADC_SQR3_SQ2_Pos
			| 3u << ADC_SQR3_SQ3_Pos
			| 4u << ADC_SQR3_SQ4_Pos
			| 7u << ADC_SQR3_SQ5_Pos
			| 5u << ADC_SQR3_SQ6_Pos));
	
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1),
			ADC_CR1_SCAN));
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
			ADC_CR2_DMA));
		
		mcutl::adc::configure<adc,
			mcutl::adc::init::scan_channels<dma_config,
				mcutl::adc::channel<1>,
				mcutl::adc::channel<0>,
				mcutl::adc::channel<3>,
				mcutl::adc::channel<4>,
				mcutl::adc::channel<7>,
				mcutl::adc::channel<5>,
		
				mcutl::adc::channel<6>,
				mcutl::adc::channel<11>,
				mcutl::adc::channel<8>,
				mcutl::adc::channel<2>,
				mcutl::adc::channel<1>,
				mcutl::adc::channel<9>,
		
				mcutl::adc::channel<0>,
				mcutl::adc::channel<12>>,
			mcutl::adc::init::base_configuration_is_currently_present
		>();
	}
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest7)
{
	using adc = typename TestFixture::adc;
	
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_ADON);
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::wait_finished<72'000'000, simple_clock_config>,
		mcutl::adc::init::enable<true>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureBaseConfigPresentTest8)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	this->setup_systick();
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2), ADC_CR2_ADON));
	this->expect_wait_init();
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::wait_finished<100'000'000, simple_clock_config>,
		mcutl::adc::init::enable<true>,
		mcutl::adc::init::base_configuration_is_currently_present
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureTest1)
{
	using adc = typename TestFixture::adc;
	
	::testing::InSequence s;
	this->expect_enable_peripheral();
	
