dragon-dreamer/mcutl/tests/stm32f1_adc_tests.cpp
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR1), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR2), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1),
		(1u << ADC_SQR1_L_Pos)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR2), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3), 11u));
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1),
		ADC_CR1_EOSIE));
	
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		ADC_CR2_ADON));
	
	this->expect_enable_interrupt(std::is_same_v<adc, mcutl::adc::adc3> ? ADC3_IRQn : ADC1_2_IRQn,
		3u << 1, 1u);
	
	mcutl::adc::configure<adc,
		mcutl::adc::init::enable_peripheral<true>,
		mcutl::adc::channel<11>,
		mcutl::adc::init::enable<true>,
		mcutl::adc::init::data_alignment::right,
		mcutl::interrupt::interrupt<mcutl::adc::init::interrupt::conversion_complete, 3, 1>,
		mcutl::adc::init::interrupt::enable_controller_interrupts,
		mcutl::interrupt::priority_count<8>
	>();
}

TYPED_TEST(adc_list_test_fixture, ConfigureTest2)
{
	using adc = typename TestFixture::adc;
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR1), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SMPR2), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR2), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1), 0u));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2), 0u));
	
	this->expect_disable_interrupt(std::is_same_v<adc, mcutl::adc::adc3> ? ADC3_IRQn : ADC1_2_IRQn);
	
	mcutl::adc::configure<adc,
		mcutl::interrupt::disabled<mcutl::adc::init::interrupt::conversion_complete>,
		mcutl::adc::init::interrupt::disable_controller_interrupts
	>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest1)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	this->memory().set(this->addr(&this->get_adc()->CR2), 0xffffffffu & ~ADC_CR2_ADON);
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2), 0xffffffffu));
	
	mcutl::adc::reconfigure<adc, mcutl::adc::init::enable<true>>();
	
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_ADON);
	mcutl::adc::reconfigure<adc, mcutl::adc::init::enable<true>>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest2)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR1));
	this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
	this->memory().set(this->addr(&this->get_adc()->CR1), ADC_CR1_SCAN | ADC_CR1_EOSIE);
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_DMA | ADC_CR2_ADON);
	this->memory().set(this->addr(&this->get_adc()->SQR1), 12u << ADC_SQR1_L_Pos);
	this->memory().set(this->addr(&this->get_adc()->SQR3), 10u << ADC_SQR3_SQ1_Pos);
	
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1), ADC_CR1_EOSIE));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2), ADC_CR2_ADON));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1), 1u << ADC_SQR1_L_Pos));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3), 2u << ADC_SQR3_SQ1_Pos));
	
	mcutl::adc::reconfigure<adc, mcutl::adc::channel<2>>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest3)
{
	using adc = typename TestFixture::adc;
	
	this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_DMA);
	this->setup_systick();
	
	::testing::InSequence s;
	EXPECT_CALL(this->memory(), read(this->addr(&this->get_adc()->CR2)));
	EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
		ADC_CR2_DMA | ADC_CR2_ADON));
	this->expect_wait_init();
	
	mcutl::adc::reconfigure<adc,
		mcutl::adc::init::enable<true>,
		mcutl::adc::init::wait_finished<100'000'000, simple_clock_config>>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest4)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR1));
	
	mcutl::adc::reconfigure<adc,
		mcutl::adc::init::interrupt::enable_controller_interrupts>();
	
	this->expect_enable_interrupt(
		std::is_same_v<adc, mcutl::adc::adc3> ? ADC3_IRQn : ADC1_2_IRQn);
	
	this->memory().set(this->addr(&this->get_adc()->CR1), ADC_CR1_EOSIE);
	
	mcutl::adc::reconfigure<adc,
		mcutl::adc::init::interrupt::enable_controller_interrupts>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest5)
{
	using adc = typename TestFixture::adc;
	
	this->memory().allow_reads(this->addr(&this->get_adc()->CR1));
	this->memory().set(this->addr(&this->get_adc()->CR1), ADC_CR1_EOSIE);
	
	mcutl::adc::reconfigure<adc,
		mcutl::adc::init::interrupt::disable_controller_interrupts>();
	
	this->memory().set(this->addr(&this->get_adc()->CR1), 0u);
	
	this->expect_disable_interrupt(
		std::is_same_v<adc, mcutl::adc::adc3> ? ADC3_IRQn : ADC1_2_IRQn);
	
	mcutl::adc::reconfigure<adc,
		mcutl::adc::init::interrupt::disable_controller_interrupts>();
}

TYPED_TEST(adc_list_test_fixture, ReConfigureTest6)
{
	using adc = typename TestFixture::adc;
	
	if constexpr (!std::is_same_v<adc, mcutl::adc::adc2>)
	{
		using dma_config = mcutl::adc::dma_channel_config<
			mcutl::adc::dma_channel<adc>,
			mcutl::dma::priority::high
		>;
		
		this->memory().allow_reads(this->addr(&this->get_adc()->CR1));
		this->memory().allow_reads(this->addr(&this->get_adc()->CR2));
		this->memory().set(this->addr(&this->get_adc()->CR1), ADC_CR1_EOSIE);
		this->memory().set(this->addr(&this->get_adc()->CR2), ADC_CR2_ADON);
		
		::testing::InSequence s;
		
		this->expect_configure(this->get_dma_channel(),
			DMA_CCR_MINC | DMA_CCR_PSIZE_1 | DMA_CCR_MSIZE_0 | DMA_CCR_PL_1,
			0, mcutl::interrupt::default_priority, 0,
			0x12345678u & ~DMA_CCR_EN);
		
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR1),
			3u << ADC_SQR1_L_Pos));
	
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->SQR3),
			5u << ADC_SQR3_SQ1_Pos
			| 7u << ADC_SQR3_SQ2_Pos
			| 11u << ADC_SQR3_SQ3_Pos));
	
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR1),
			ADC_CR1_EOSIE | ADC_CR1_SCAN));
		EXPECT_CALL(this->memory(), write(this->addr(&this->get_adc()->CR2),
			ADC_CR2_ADON | ADC_CR2_DMA));
		
		mcutl::adc::reconfigure<adc,
			mcutl::adc::init::scan_channels<dma_config,
				mcutl::adc::channel<5>,
				mcutl::adc::channel<7>,
				mcutl::adc::channel<11>>
		>();
	}
}
